tutorials/incompressible/adjointLPBFShapeOptimizationFoam/StaticMixer_1el/0.orig/Conca
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Conca;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 5 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform -1;
    }

    outlet
    {
        type            adjointOutletConcentration;
        value           uniform 0;
    }

    defaultName
    {
        type            fixedValue;
        value           uniform 0;
    }
}

// ************************************************************************* //