tutorials/incompressible/adjointLPBFShapeOptimizationFoam/StaticMixer_1el/0.orig/Ta
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 -1 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform -1;
    }

    outlet
    {
        type            adjointOutletTemperature;
        value           uniform 0;
    }

    defaultName
    {
        type            fixedValue;
        value           uniform 0;
    }    
}

// ************************************************************************* //