tutorials/incompressible/adjointLPBFShapeOptimizationFoam/StaticMixer_1el/0.orig/Ua
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      Ua;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (-1 0 0);
    }

    outlet
    {
      type            adjointOutletVelocity;
      value           uniform (0 0 0);
    }

    defaultName
    {
        type            noSlip;
    }
}

// ************************************************************************* //