tutorials/incompressible/adjointLPBFShapeOptimizationFoam/StaticMixer_1el/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          decomposeParDict;
}

numberOfSubdomains 8;

method          scotch;


// ************************************************************************* //
