tutorials/incompressible/adjointLPBFShapeOptimizationFoam/StaticMixer_1el/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
    grad(p)         faceMDLimited leastSquares 1;
    grad(T)         faceMDLimited leastSquares 1;
    grad(Conc)      faceMDLimited leastSquares 1;
    grad(Ua)        cellLimited Gauss linear 1;
    grad(pa)        faceMDLimited leastSquares 1;
    grad(Ta)        faceMDLimited Gauss linear 1;
    grad(Conca)     faceMDLimited leastSquares 1;
}

divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss linearUpwindV grad(U);
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,T)      bounded Gauss linearUpwind grad(T);
    div(phi,Conc)   bounded Gauss linearUpwind grad(Conc);
    div(-phi,Ua)    bounded Gauss linearUpwindV grad(Ua);
    div((nuEff*dev2(T(grad(Ua))))) Gauss linear;
    div(-phi,Ta)    bounded Gauss linearUpwind grad(Ta);
    div(-phi,Conca) bounded Gauss linearUpwind grad(Conca);
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

// ************************************************************************* //