tutorials/incompressible/adjointLPBFShapeOptimizationFoam/StaticMixer_1el/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pa)"
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.001;
        smoother         DICGaussSeidel;
    }

    Phi
    {
        $p;
    }

    "(U|Ua)"
    {
        solver           smoothSolver;
        smoother         DILUGaussSeidel;
        tolerance        1e-8;
        relTol           0.001;
        nSweeps          1;
    }

    "(T|Ta)"
    {
        solver          smoothSolver;
        smoother        DILUGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        nSweeps         1;
    }

    "(Conc|Conca)"
    {
        solver          smoothSolver;
        smoother        DILUGaussSeidel;
        tolerance       1e-8;
        relTol          0.0;
        nSweeps         1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        "(p|pa)"    1e-4;
        "(U|Ua)"    1e-4;
        "(T|Ta)"    1e-4;
        Conc        1e-4;
        Conca       2e-4;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
        alpha           0.05;
        p               0.7;
        pa              0.5;
        U               0.3;
        Ua              0.5;
        T               0.8;
        Conc            0.8;
        Ta              1;
        Conca           0.8;
    }
    equations
    {
        alpha           0.05;
        p               0.7;
        pa              0.5;
        U               0.3;
        Ua              0.5;
        T               0.8;
        Conc            0.8;
        Ta              1;
        Conca           0.8;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //